erpdev.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dfa19489-ad65-49e8-bcaa-38abf251ab1a">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="608ab205-e85c-4c0c-bb0a-19c0fcca2cd5">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоденДо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb25b6bc-7f7a-447b-8658-e8893ac87128">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="43c7d80b-bd8e-4151-b0e1-084444292845">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="448beea5-fe0e-4558-b386-88fdde891a35">
    <name>ПроизводительВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="811ed59d-1e61-4b9f-b4fb-3b5dc1e65b8c">
    <name>RFIDUser</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf11029-162c-49c8-b54b-767bda8ca180">
    <name>СерияНоменклатурыДляЦенообразования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80a89a7f-1fed-4811-b40c-3a5ab50662a9">
    <name>RFIDTID</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0c1efe6-bb2e-4ed3-80a8-cab3c7e1b456">
    <name>RFIDEPC</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6dd6eb6e-b1b8-4da9-9b97-35f41594d1d6">
    <name>EPCGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50ccfd5f-e7cd-4e00-a6ee-2b31c3198df5">
    <name>RFIDМеткаНеЧитаемая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ebda52-1b95-4474-a953-08ea8d771161">
    <name>НомерКиЗГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b41bc339-8059-4e1b-a18e-9b2d19e4c2e1">
    <name>ПроизводительЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0031dd3e-8675-47e2-ae98-c7e7a9b2060a">
    <name>ИдентификаторПартииВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f266e93e-196b-4c32-867c-1eb7dcc148b4">
    <name>Справка2ЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888c0446-d41f-43e2-9d71-c2abeb77ef11">
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff2d5643-26e8-40ec-b266-8fb17cd78983">
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция Расш1_ПроверкаСтатуса()
 	Возврат Объект.Статус <> Перечисления.СтатусыПриходныхОрдеров.принят	
КонецФункции

&НаКлиенте
Процедура Расш1_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если  Расш1_ПроверкаСтатуса() Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Не забудьте установить статус Принят!",5,"Внимание!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	
	
КонецПроцедуры


&НаКлиенте
Процедура Расш1_ОтправительПриИзмененииПеред(Элемент)
	ВидимостьКнопкиСерии();
КонецПроцедуры


&НаКлиенте
Процедура Расш1_СкладПриИзмененииПеред(Элемент)
	ВидимостьКнопкиСерии();
КонецПроцедуры


&НаСервере
Процедура ВидимостьКнопкиСерии()
	
	Если Объект.Отправитель = Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции") И Объект.Склад = Справочники.Склады.НайтиПоНаименованию("ЦК Цех Комплектации") Тогда
		ЭтаФорма.Элементы.ТоварыУказатьСерии.Видимость = Ложь;
		ЭтаФорма.Элементы.ТоварыСоздатьСерии.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ТоварыУказатьСерии.Видимость = Истина;
		ЭтаФорма.Элементы.ТоварыСоздатьСерии.Видимость = Ложь;
	КонецЕсли;
	
		
КонецПроцедуры


&НаКлиенте
Процедура Расш1_СоздатьСерииПосле(Команда)
	
	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);	
	
	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНомен,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура,"");
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйСерия", ЭтаФорма);
	
	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйСерия(Значение, ДопПараметры) Экспорт  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия = ПолучитьСериюПоНомеру(Строка(Значение.Номер),ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);		
	КонецЕсли;
КонецПроцедуры     



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерииИзСписка(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Товары.ТекущиеДанные.Серия = ПолучитьСериюПоНомеру(Значение.Номер,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);		
	КонецЕсли;
	
 	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры     

 &НаСервере
 Функция  ПолучитьСериюПоНомеру(Номер,Номенклатура) 
	 
	СсылкаСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СерииНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	               |ГДЕ
	               |	СерииНоменклатуры.Номер = &Номер
	               |	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры" ;
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		СсылкаСерия =  Рез.Ссылка;
	КонецЕсли;
	
 	Возврат  СсылкаСерия;
	
КонецФункции



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыВыборСерии(Значение, ДопПараметры) Экспорт  
  
	Если ЗначениеЗаполнено(Значение) Тогда                  
		ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия = ПолучитьСериюПоНомеру(Значение.Номер,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);		
	КонецЕсли;

КонецПроцедуры     



&НаСервере
Функция ПолучитьВидНоменклатуры(Номенклатура) 
	Если Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Готовая продукция: Батончики") Тогда
		Возврат Номенклатура.ВидНоменклатуры;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	ВидимостьКнопкиСерии();
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ТоварыСерияНачалоВыбораИзСпискаПеред(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Номенклатура);	

	ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура,Ссылка", ВидНомен,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Товары,ЭтаФорма.Элементы.Продукция.ТекущиеДанные.Расш1_Серия);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерии", ЭтаФорма);

	ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСерии", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры

&НаКлиенте
Процедура Расш1_ТоварыСерияНачалоВыбораВместо(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидНомен = ПолучитьВидНоменклатуры(ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);	
	
	Если ВидНомен = Ложь Тогда 
		ОткрытьПодборСерий(Элемент.ТекстРедактирования);
	Иначе
		
		ЭлементыОтбора = Новый Структура("ВидНоменклатуры,Номенклатура", ВидНомен,ЭтаФорма.Элементы.Товары.ТекущиеДанные.Номенклатура);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыВыборСерииИзСписка", ЭтаФорма);
		
		ОткрытьФорму("Обработка.СХК_СоздатьСерии.Форма.ФормаСписка", ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры
